sedi2/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    y1
    {
        type            patch;
        nFaces          625;
        startFace       90625;
    }
    y0
    {
        type            patch;
        nFaces          625;
        startFace       91250;
    }
    x0
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1250;
        startFace       91875;
    }
    x1
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1250;
        startFace       93125;
    }
    z0
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          1250;
        startFace       94375;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  z1;
    }
    z1
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          1250;
        startFace       95625;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  z0;
    }
)

// ************************************************************************* //
