sedi2/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;


boundaryField
{

      y0
      {
          type            fixedFluxPressure;
          gradient        $internalField;
      }



      y1
      {
          type          fixedValue;
          value         uniform 0;
      }


      x0
      {
          type            fixedFluxPressure;
          value           $internalField;
      }



      x1
      {
        type            fixedFluxPressure;
        value           $internalField;
      }



    z0
    {
        type            cyclic;
    }



    z1
    {
        type            cyclic;
    }


}

// ************************************************************************* //
