sedi2/0/uSourceDrag
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      uSourceDrag;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 0 ;

boundaryField
{

  y1
  {
    type calculated;
    value uniform 0;
  }



  y0
  {
    type calculated;
    value uniform 0;
  }



  x1
  {
    type calculated;
    value uniform 0;
  }



  x0
  {
    type calculated;
    value uniform 0;
  }



  z1
  {
        type            cyclic;
  }


  z0
  {
    type            cyclic;
  }


}
// ************************************************************************* //
